Ran Plan for 2 projects:

1. dir: `terraform/atlantis` workspace: `default`
1. dir: `terraform` workspace: `default`

### 1. dir: `terraform/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              + "cert-manager.io/alt-names"        = "wayofthesys.com"
              + "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls"
              + "cert-manager.io/common-name"      = "wayofthesys.com"
              + "cert-manager.io/ip-sans"          = ""
              + "cert-manager.io/issuer-group"     = "cert-manager.io"
              + "cert-manager.io/issuer-kind"      = "ClusterIssuer"
              + "cert-manager.io/issuer-name"      = "zerossl"
              + "cert-manager.io/uri-sans"         = ""
            }
            name             = "wayofthesys-com-pritunl-tls"
          ~ resource_version = "14716001" -> "14716473"
            # (4 unchanged attributes hidden)
        }
    }
  # helm_release.pritunl has been changed
~ resource "helm_release" "pritunl" {
        id                         = "pritunl"
      ~ metadata                   = [
          ~ {
              ~ revision    = 2 -> 3
              ~ values      = jsonencode(
                  ~ {
                      ~ image          = {
                          ~ tag         = "pritunl:fae80ee6" -> "pritunl:dc7700e4"
                            # (5 unchanged elements hidden)
                        }
                        # (8 unchanged elements hidden)
                    }
                )
                # (5 unchanged elements hidden)
            },
        ]
        name                       = "pritunl"
      ~ status                     = "deployed" -> "failed"
        # (25 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.pritunl will be updated in-place
~ resource "helm_release" "pritunl" {
        id                         = "pritunl"
        name                       = "pritunl"
      ~ status                     = "failed" -> "deployed"
      ~ version                    = "0.0.6" -> "0.0.7"
        # (25 unchanged attributes hidden)
    }

  # kubernetes_secret.tls will be updated in-place
~ resource "kubernetes_secret" "tls" {
      ~ data      = (sensitive value)
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (2 unchanged attributes hidden)

      ~ metadata {
          ~ annotations      = {
              - "cert-manager.io/alt-names"        = "wayofthesys.com" -> null
              - "cert-manager.io/certificate-name" = "wayofthesys-com-pritunl-tls" -> null
              - "cert-manager.io/common-name"      = "wayofthesys.com" -> null
              - "cert-manager.io/ip-sans"          = "" -> null
              - "cert-manager.io/issuer-group"     = "cert-manager.io" -> null
              - "cert-manager.io/issuer-kind"      = "ClusterIssuer" -> null
              - "cert-manager.io/issuer-name"      = "zerossl" -> null
              - "cert-manager.io/uri-sans"         = "" -> null
            }
            name             = "wayofthesys-com-pritunl-tls"
            # (5 unchanged attributes hidden)
        }
    }

  # tls_cert_request.request must be replaced
-/+ resource "tls_cert_request" "request" {
      ~ cert_request_pem = <<-EOT
            -----BEGIN CERTIFICATE REQUEST-----
            MIIDBTCCAe0CAQAwNDERMA8GA1UEChMIQXRsYW50aXMxHzAdBgNVBAMTFmFyZ29j
            ZC53YXlvZnRoZXN5cy5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
            AQDmUkNgCTSDgLGQkK7pqaAIBnYhJ3uu+y68Yk0/6H8FL/o3VW0PG42b+RWRQZEc
            n6GOAMjyHRzwH1XnMmxBV/++iGVgUN/PKyIwTSHB6PJeJo9p5IxfRVlFSpUYE0bT
            z8wjAadyiAZq7xGTnNegXu0EeMg8yVTmg2istL3kx+XkWoL9TPaQBE0Fw88+lumC
            Rv1onKY+AhB/1yYipeqVdB6w0y54LIuVc2DLqT25osThOWKE1SFQ6EqmlP46L+Mo
            Jj62y/n663Oik+KYl5v3QT7l+ujFECMoyUnQxb7QMdOqxkPaCeY/CdpFnvfCZret
            kyZQKtZ2A0IDZyi/+FJFTLwbAgMBAAGggYswgYgGCSqGSIb3DQEJDjF7MHkwdwYD
            VR0RBHAwboIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZh
            dWx0LnN2Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwud2F5b2Z0
            aGVzeXMuY29thwR/AAABhwSKxTD3MA0GCSqGSIb3DQEBCwUAA4IBAQB2X4PaHwMg
            4EcH3eLatGHqmjT5qUwsVj6mkljBWp3NmHuWc/+WnJOGu9ZGcwNNdnub9ccPaY+Q
            PZNgVVH5Cq6y98Azj4zpRr+6a+JxiI/N0iRJSfa3AMRifLEW+UtiCKBT6YaTV+l2
            j31m9QaPcGTmP9cJHV0zY53FQPYG+Q/JVVMe4B84of55KoOOMocsHemU2OX7O0uh
            UnpJHzSlWngCGD4TiWLTEW92fkZ7Bszrtm8cgpboH0VZcGxQbnXo+PZACYDwEfIZ
            14VMLzqS/vrUKEfOcf5FE/z56Z0oi/OeCfu+TSdmVAcHSKz3DQ8293ifUssUiiWQ
            B7K6HdeAy+bB
            -----END CERTIFICATE REQUEST-----
        EOT -> (known after apply)
      ~ id               = "24ea2901fedf7c750e2fe39f6fe83d0c3fafce35" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ subject {
          ~ common_name    = "argocd.wayofthesys.com" -> "pritunl.wayofthesys.com" # forces replacement
          - street_address = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # tls_locally_signed_cert.cert must be replaced
-/+ resource "tls_locally_signed_cert" "cert" {
      ~ cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDvzCCAqegAwIBAgIRAJ2loYyaiH3Cyl3QwgyCCywwDQYJKoZIhvcNAQELBQAw
            JTEQMA4GA1UEChMHUHJpdHVubDERMA8GA1UEAxMIY2EubG9jYWwwHhcNMjIwMzA2
            MjMzMjIyWhcNMjMwMzA2MjMzMjIyWjA0MREwDwYDVQQKEwhBdGxhbnRpczEfMB0G
            A1UEAxMWYXJnb2NkLndheW9mdGhlc3lzLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOZSQ2AJNIOAsZCQrumpoAgGdiEne677LrxiTT/ofwUv+jdV
            bQ8bjZv5FZFBkRyfoY4AyPIdHPAfVecybEFX/76IZWBQ388rIjBNIcHo8l4mj2nk
            jF9FWUVKlRgTRtPPzCMBp3KIBmrvEZOc16Be7QR4yDzJVOaDaKy0veTH5eRagv1M
            9pAETQXDzz6W6YJG/Wicpj4CEH/XJiKl6pV0HrDTLngsi5VzYMupPbmixOE5YoTV
            IVDoSqaU/jov4ygmPrbL+frrc6KT4piXm/dBPuX66MUQIyjJSdDFvtAx06rGQ9oJ
            5j8J2kWe98Jmt62TJlAq1nYDQgNnKL/4UkVMvBsCAwEAAaOB2jCB1zAOBgNVHQ8B
            Af8EBAMCAqQwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMAwGA1UdEwEB
            /wQCMAAwHwYDVR0jBBgwFoAUiX7mn7B4BkrbgISk8XecJhMj9owwdwYDVR0RBHAw
            boIIYXRsYW50aXOCDmF0bGFudGlzLmxvY2FsgiJhdGxhbnRpcy5kZWZhdWx0LnN2
            Yy5jbHVzdGVyLmxvY2Fsgglsb2NhbGhvc3SCF3ByaXR1bmwud2F5b2Z0aGVzeXMu
            Y29thwR/AAABhwSKxTD3MA0GCSqGSIb3DQEBCwUAA4IBAQCjL2EhEiRTy+n7RHeI
            0TWdF1MOzJci/9ZV9k6EpWtyDHTd/wGb3GDz6ZN85z4eAFUXcxDFXVJ1aARMSHG2
            MeXVpBnEaFqmmTwaB4aZwtxiqJCzR6Lnbnwx69AIqwuNaD/9dUy3kntCVWyb2N1h
            nbHFnZAPSOWCmuujLJ1O4F3QYD4KAwtA9XukVAJJmKUoPOUEbSbVwhHR7ANZ0iXS
            W2ByR5B0uhSjus52FarhJfs+Iu/ugzkQTHMxqmxd35h6+lk7MppUYNCcQVsUzFL1
            oCjl+dMf16DzQX8tiZqu1FRF+Wv6U9Jn+mqTOakEeTD6RAuVAzEXAS9AhAhfwXb6
            b7DP
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ cert_request_pem      = "f4f49ee67905137236b4364afa12ea4130350823" -> (known after apply) # forces replacement
      ~ id                    = "209548800927604677833566238818974173996" -> (known after apply)
      ~ ready_for_renewal     = false -> true
      ~ validity_end_time     = "2023-03-06T23:32:22.865429941Z" -> (known after apply)
      ~ validity_start_time   = "2022-03-06T23:32:22.865429941Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Warning: Argument is deprecated

  with tls_self_signed_cert.ca,
  on tls.tf line 24, in resource "tls_self_signed_cert" "ca":
  24:   key_algorithm   = tls_private_key.ca.algorithm

This is now ignored, as the key algorithm is inferred from the
`private_key_pem`.

(and 5 more similar warnings elsewhere)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 2 to change, 2 to destroy.

---
### 2. dir: `terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform/default.tfplan\"" in "/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform": exit status 1

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Error: No value for required variable

  on variables.tf line 72:
  72: variable "atlantis_github_user" {

The root module input variable "atlantis_github_user" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 76:
  76: variable "atlantis_github_user_token" {

The root module input variable "atlantis_github_user_token" is not set, and
has no default value. Use a -var or -var-file command line argument to
provide a value for this variable.

Error: No value for required variable

  on variables.tf line 80:
  80: variable "letsencrypt_email" {

The root module input variable "letsencrypt_email" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 101:
 101: variable "github_token" {

The root module input variable "github_token" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 105:
 105: variable "sslcom_keyid" {

The root module input variable "sslcom_keyid" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 109:
 109: variable "sslcom_hmac_key" {

The root module input variable "sslcom_hmac_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 113:
 113: variable "sslcom_private_hmac_key" {

The root module input variable "sslcom_private_hmac_key" is not set, and has
no default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 125:
 125: variable "oauth_cookie_secret" {

The root module input variable "oauth_cookie_secret" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 129:
 129: variable "aws_access_key_id" {

The root module input variable "aws_access_key_id" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 133:
 133: variable "aws_secret_access_key" {

The root module input variable "aws_secret_access_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
